InformationRegisters/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПринятПоДолгосрочномуДоговору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НаборЗаписей", ЭтотОбъект.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборЗаписей.Период,
	|	НаборЗаписей.ФизЛицо,
	|	НаборЗаписей.Организация,
	|	НаборЗаписей.ПринятПоДолгосрочномуДоговору,
	|	НаборЗаписей.ПериодЗавершения,
	|	НаборЗаписей.Документ
	|ПОМЕСТИТЬ ВТНаборЗаписей
	|ИЗ
	|	&НаборЗаписей КАК НаборЗаписей
	|";
	Запрос.Выполнить(); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборЗаписей.Период,
	|	НаборЗаписей.ФизЛицо,
	|	ВЫБОР
	|		КОГДА НаборЗаписей.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НаборЗаписей.Организация
	|		ИНАЧЕ НаборЗаписей.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	НаборЗаписей.ПринятПоДолгосрочномуДоговору,
	|	ВЫБОР
	|		КОГДА НаборЗаписей.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НаборЗаписей.ПериодЗавершения
	|		ИНАЧЕ КОНЕЦПЕРИОДА(НаборЗаписей.ПериодЗавершения, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодЗавершения,
	|	НаборЗаписей.Документ
	|ИЗ
	|	ВТНаборЗаписей КАК НаборЗаписей";
	ЭтотОбъект.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
